Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/irish_social_welfare_system/christmas_bonus.html.txt.tmx
Source language: en
Languages: ga

source: A Christmas Bonus will be paid in December 2016 to people getting a long-term social welfare payment
ga: Íocfar Bónas na Nollag i Nollaig 2016 le daoine a bhfuil íocaíocht fhadtéarmach leasa shóisialaigh á fáil acu

source: In 2016 the Christmas Bonus will be 85% of your normal weekly payment
ga: 85% de do ghnáthíocaíocht sheachtainiúil a bheidh i mBónas na Nollag

source: The Christmas Bonus is generally paid during the first week of December
ga: Is gnách go n-íoctar Bónas na Nollag i rith na chéad seachtaine i Nollaig

source: In December 2016, the Christmas Bonus will be paid to people getting the following payments:
ga: I Nollaig 2016, íocfar Bónas na Nollaig le daoine a bhfuil na híocaíochtaí a leanas á bhfáil acu:

source: • Back to Education Allowance (people coming from jobseeker's payments must have been on their payment and/or BTEA for 15 months)
ga: • Liúntas um Fhilleadh ar Oideachas (ní mór go raibh a n-íocaíocht á fáil ag daoine atá ag aistriú ó íocaíochtaí cuardaitheora poist agus/nó go bhfuil daoine rannpháirteach sa LFAO ar feadh 15 mhí)

source: • Back to Work Allowance
ga: • An Liúntas um Fhilleadh ar Obair

source: • Back to Work Enterprise Allowance
ga: • An Liúntas Fiontraíochta um Fhilleadh ar Obair

source: • Back to Work Family Dividend
ga: • An Díbhinn Teaghlaigh um Fhilleadh ar Obair

source: • Basic Supplementary Welfare Allowance (long-term only - 15 months)
ga: • Liúntas Bunúsach Leasa Forlíontach (íocaíocht fhadtéarmach amháin – 15 mhí)

source: • Carer's Allowance and Benefit (including half-rate Carer's Allowance)
ga: • Liúntas agus Sochar Cúramóra (Liúntas Cúramóra leathráta san áireamh)

source: • Deserted Wife's Allowance and Benefit
ga: • Liúntas agus Sochar Banchéile Thréigthe

source: • Disablement Pension and Widow's, Widower's or Surviving Civil Partner's Pension under the Occupational Injuries Scheme
ga: • Pinsean Míchumais agus Pinsean Baintrí, Baintreach Fir nó Páirtnéara Shibhialta Mharthanaigh faoi Scéim Díobhálacha Ceirde

source: • Guardian's Payment (Contributory) and (Non-Contributory)
ga: • Íocaíocht Chaomhnóra (Ranníocach) agus (Neamh-Ranníocach)

source: • JobBridge (people coming from jobseeker's payments must have been on their payment and/or JobBridge for 15 months)
ga: • JobBridge (ní mór go raibh a n-íocaíocht á fáil ag daoine atá ag aistriú ó íocaíochtaí cuardaitheora poist agus/nó go bhfuil daoine rannpháirteach in JoBridge ar feadh 15 mhí)

source: • Jobseeker's Allowance (long-term only - 15 months (over 390 days of unemployment))
ga: • Liúntas Cuardaitheora Poist

source: • State Pension (Contributory) and (Non-Contributory)
ga: • Pinsean Stáit (Ranníocach) agus (Neamh-Ranníocach)

source: • VTOS (people coming from jobseeker's payments must have been on their payment and/or VTOS for 15 months)
ga: • SDOG (ní mór go raibh a n-íocaíocht á fáil ag daoine atá ag aistriú ó íocaíochtaí cuardaitheora poist agus/nó go bhfuil daoine rannpháirteach in VTOS ar feadh 15 mhí)

source: • Widow, Widower's or Surviving Civil Partner's Pension (Contributory) and (Non-Contributory)
ga: • Pinsean Baintrí, Baintreach Fir nó Páirtnéara Shibhialta Mharthanaigh (Ranníocach) agus (Neamh-Ranníocach)

source: For Jobseeker’s Allowance (JA) or Basic Supplementary Welfare Allowance (BSWA), you must be getting the payment for 15 months to get a Christmas Bonus
ga: Má fhaigheann tú Liúntas Cuardaitheora Poist (LCP) nó Liúntas Leasa Forlíontach Bunúsach (LLFB), ní mór duit bheith ag fáil an íocaíocht ar feadh 15 mí chun Bónas Nollag a fháil

source: However, if you were getting another payment eligible for the Christmas Bonus immediately before claiming JA or BSWA, and your combined time on eligible payments is 15 months, you will get the Christmas Bonus
ga: Áfach, má fhaigheann tú íocaíocht atá incháilithe le haghaidh an Bhónais Nollag díreach roimh ar éiligh tú LCP nó LLFB agus má tá d’amanna ar íocaíochtaí incháilithe comhcheangailte 15 mí, gheobhaidh tú an Bónas Nollag

source: It will be paid to certain participants on some Further Education and Training (FET) courses (people coming from jobseeker's payments must have been on their payment and/or training allowance for 15 months)
ga: Íocfar an bónas le rannpháirtithe áirithe ar roinnt cúrsaí Breisoideachais agus Oiliúna (FET) (ní mór go raibh a n-íocaíocht á fáil ag daoine atá ag aistriú ó íocaíochtaí cuardaitheora poist agus/nó go bhfuil liúntas oiliúna á fháil ag daoine ar feadh 15 mhí)

source: Note that for Domiciliary Care Allowance (DCA) which is paid monthly the bonus is 85% of the weekly payment
ga: Tabhair faoi deara, i gcás Liúntas Cúram Baile (LCB), a íoctar gach mí, is ionann an bónas agus 75% den íocaíocht sheachtainiúil

source: The DCA portion of the Bonus is calculated independently of other payments
ga: Ríomhtar sciar LCB an Bhónais ar leithligh ó íocaíochtaí eile

source: So, for example, if you were getting DCA for one child 85% of the weekly payment is €60.70
ga: Mar sin, mar shampla, má bhí LCB á fháil agat do leanbh amháin, is ionann 85% den íocaíocht sheachtainiúil agus €60.70

source: The Christmas Bonus is also paid to people gettting Blind Welfare Allowance, Mobility Allowance, and rehabilitative training allowances from the HSE
ga: Anuas air sin, íoctar Bónas na Nollag le daoine a bhfuil Liúntas Leasa na nDall, Liúntas Soghluaisteachta, agus liúntais oiliúna athshlánúcháin á bhfáil acu ó FSS

source: Survivors of Thalidomide who get payments from the Department of Health also get the bonus
ga: Íoctar an bónas le marthanóirí Tailídimíde a fhaigheann íocaíochtaí ón Roinn Sláinte, chomh maith

source: In 2016 the Christmas Bonus will be 85% of your normal weekly payment (including the Living Alone Increase, the Island Allowance and the Over-80 Increase)
ga: In 2016, is ionann a bheidh Bónas na Nollag agus 85% de do ghnáthíocaíocht sheachtainiúil (Méadú do Mhaireachtáil Aonair, Liúntas Oileáin agus an Méadú do Dhaoine os cionn 80 bliain d’aois ina measc)

source: The Christmas Bonus does not include Fuel Allowance
ga: Ní áirítear le Bónas na Nollag Liúntas Breosla

source: The minimum Christmas Bonus payment is €20
ga: Is í íocaíocht íosta Bhónas na Nollag €20

source: If an Increase for a Qualified Adult is paid directly to your dependent spouse, civil partner or cohabitant the Christmas Bonus will also be paid directly to them
ga: Má íoctar Méadú do Dhuine Fásta Cáilithe go díreach le do chéile, páirtnéir sibhialta nó do chomháitritheoir cleithiúnach, íocfar Bónas na Nollag go díreach leo chomh maith

source: If you are getting 2 eligible social welfare payments (for example, a One-Parent Family Payment and the Domiciliary Care Allowance or a half-rate Carer’s Allowance as well as your primary payment) you will get the Christmas Bonus in respect of both payments
ga: Má tá dhá íocaíocht incháilithe leasa shóisialaigh á bhfáil agat (mar shampla, Íocaíocht Teaghlach Aontuismitheora agus an Liúntas Cúram Baile nó Liúntas Cúramóra Leathráta anuas ar do phríomhíocaíocht, gheobhaidh tú Bónas na Nollag maidir leis an dá íocaíocht

source: The Christmas Bonus was 75% of the normal weekly payment (including the Living Alone Increase, the Island Allowance and the Over-80 Increase)
ga: B’ionann Bónas na Nollag agus 75% den ghnáthíocaíocht sheachtainiúil (Méadú do Mhaireachtáil Aonair, Liúntas Oileáin agus an Méadú do Dhaoine os cionn 80 bliain d’aois ina measc) agus bhí íocaíocht íosta €20 i gceist

source: The Christmas Bonus did not include Fuel Allowance with a minimum payment of €20
ga: Níor áiríodh le Bónas na Nollag Liúntas Breosla
